# LayerElemIsStructuralMaterial Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LayerElemIsStructuralMaterial Property
ParameterTypeId Class See Also
---
"Is Structural Material"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LayerElemIsStructuralMaterial { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LayerElemIsStructuralMaterial As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LayerElemIsStructuralMaterial {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace